<script setup>
const isOpen = ref(false)
</script>

<template>
    <div>
        <UButton label="Узнать больше" variant="outline" icon="i-heroicons-arrow-right-20-solid" :trailing="true"
            color="lime" @click="isOpen = true" />

        <USlideover v-model="isOpen">
            <div class="p-4 flex-1">
                <h1 class="text-2xl font-bold mb-4 text-center">Механизированная покраска</h1>
                <p class="mb-4">Механизированная покраска — это процесс нанесения краски на поверхность с помощью
                    специального
                    оборудования. Это
                    может быть ручное или автоматическое оборудование, но в любом случае оно использует сжатый воздух для
                    распыления
                    краски.</p>
                <p class="mb-4">Механизированная покраска имеет ряд преимуществ перед ручной покраской. Она позволяет
                    наносить краску
                    более
                    равномерно и быстро, что обеспечивает более высокое качество покрытия. Кроме того, механизированная
                    покраска
                    позволяет использовать различные типы красок, которые могут быть недоступны для ручной покраски.</p>
                <ul class="list-disc pl-6 mb-4">
                    <li>Более равномерное покрытие</li>
                    <li>Более высокая производительность</li>
                    <li>Высокое качество покрытия</li>
                    <li>Возможность использования различных типов красок</li>
                    <li>Подходит для больших поверхностей и поверхностей сложной формы</li>
                    <li>Экономия краски</li>
                </ul>
                <h1 class="text-2xl font-bold mb-4 text-center">Информация при выборе окрасочных материалов</h1>
                <p class="mb-4">Окрасочные материалы играют важную роль в нашей повседневной жизни. Они используются для
                    защиты,
                    украшения и
                    улучшения внешнего вида поверхностей.</p>
                <h2 class="text-xl font-bold mb-4">Типы окрасочных материалов</h2>
                <ul class="list-disc pl-6 mb-4">
                    <li>Краски</li>
                    <li>Лак</li>
                    <li>Эмаль</li>
                    <li>Грунтовка</li>
                    <li>Пропитка</li>
                </ul>
                <h3 class="text-lg font-bold mb-4">Грунтовка</h3>
                <ul class="list-disc pl-6 mb-4">
                    <li>Укрепляет основание</li>
                    <li>Выравнивает поверхность</li>
                    <li>Улучшает адгезию</li>
                    <li>Защищает поверхность</li>
                </ul>
                <h2 class="text-xl font-bold mb-4">При выборе окрасочного материала важно учитывать следующие факторы:
                </h2>
                <ul class="list-disc pl-6 mb-4">
                    <li>Тип поверхности</li>
                    <li>Условия эксплуатации</li>
                    <li>Эстетические требования</li>
                </ul>
                <h2 class="text-xl font-bold mb-4">Применение окрасочных материалов</h2>
                <ul class="list-disc pl-6 mb-4">
                    <li>Кисть</li>
                    <li>Валик</li>
                    <li>Пульверизатор</li>
                    <li>Распыление</li>
                </ul>
                <p>Следовательно, окрасочные материалы играют важную роль в нашей повседневной жизни. Они используются
                    для защиты,
                    украшения и улучшения внешнего вида поверхностей.</p>
            </div>
        </USlideover>
    </div>
</template>
