<script setup>
const isOpen = ref(false)
</script>

<template>
    <div>
        <UButton label="Узнать больше" variant="outline" icon="i-heroicons-arrow-right-20-solid" :trailing="true"
            color="lime" @click="isOpen = true" />

        <USlideover v-model="isOpen">
            <div class="p-4 flex-1">
                <h1 class="text-2xl font-bold mb-4 text-center">Механизированная покраска</h1>
                <p class="mb-4">Механизированная покраска — это процесс нанесения краски на поверхность с помощью
                    специального
                    оборудования. Это
                    может быть ручное или автоматическое оборудование, но в любом случае оно использует сжатый воздух для
                    распыления
                    краски.</p>
                <p class="mb-4">Механизированная покраска имеет ряд преимуществ перед ручной покраской. Она позволяет
                    наносить краску
                    более
                    равномерно и быстро, что обеспечивает более высокое качество покрытия. Кроме того, механизированная
                    покраска
                    позволяет использовать различные типы красок, которые могут быть недоступны для ручной покраски.</p>
                <ul class="list-disc pl-6 mb-4">
                    <li>Более равномерное покрытие</li>
                    <li>Более высокая производительность</li>
                    <li>Высокое качество покрытия</li>
                    <li>Возможность использования различных типов красок</li>
                    <li>Подходит для больших поверхностей и поверхностей сложной формы</li>
                    <li>Экономия краски</li>
                </ul>
            </div>
        </USlideover>
    </div>
</template>
